Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None)]       0                                            
__________________________________________________________________________________________________
preprocessin_model (Functional) (None, None, 128, 1) 4           the_input[0][0]                  
__________________________________________________________________________________________________
tf.compat.v1.squeeze_2 (TFOpLam (None, None, 128)    0           preprocessin_model[0][0]         
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
simple_rnn_model (Functional)   (None, None, 30)     14400       tf.compat.v1.squeeze_2[0][0]     
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           simple_rnn_model[0][0]           
                                                                 the_labels[0][0]                 
                                                                 lambda_2[0][0]                   
                                                                 label_length[0][0]               
==================================================================================================
Total params: 14,404
Trainable params: 14,402
Non-trainable params: 2
__________________________________________________________________________________________________